In [1]:
# Letâ€™s go for a dip with R

# this is a string

In [2]:
# this is a string

_this is a string_

In [3]:
x <- "This is a sample string"
print (x)

[1] "This is a sample string"

In [4]:
print(x, quote = FALSE)

[1] This is a sample string

In [5]:
# Ready to splash a little with R

In [6]:
1:19

 [1]  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19

In [7]:
sum(1:19)

[1] 190

In [12]:
x = c(3, 5, 8, 9)

In [14]:
y = c('Jack','Queen','King')

In [15]:
sum(x)

[1] 25

In [16]:
x[2]

[1] 5

In [17]:
matrix(y,2,3,byrow=T)

     [,1] [,2]  [,3]
[1,] Jack Queen King
[2,] Jack Queen King

In [ ]:
# Paddling with R

In [18]:
employee <- c("Juanita Lopez", "Peter Gynn", "Jolie Talofa")
salary <- c(81000, 83400, 96800)
startdate <- as.Date(c("2010-11-1", "2008-3-25", "2007-3-14"))
employ.data <- data.frame(employee, salary, startdate)
employ.data <- data.frame(employee, salary, startdate, stringsAsFactors = FALSE)
employ.data

  employee      salary startdate
1 Juanita Lopez 81000  2010-11-01
2 Peter Gynn    83400  2008-03-25
3 Jolie Talofa  96800  2007-03-14